# OC
Лабораторная работа №5  
Номер группы: 728111  
Номер зачетки: 1800189
## В своей виртуальной машине сделать:
1. На языке С (gcc) напишите программу с вечным циклом, выводящую каждые 5 секунд на экран вашу ФИО и номер группы. Имя программы (файла) - ваша фамилия.  
`touch khisamov.c`  
```C
#include <stdio.h>
#include <unistd.h>
int main() {
  for(;;) {
    printf("Khisamov Iskander Ravilevich 7281-11\n");
    sleep(5);
  }
  return 0;
}
```
`gcc khisamov.c -o khisamov`   
2. создать задание на запуск задание для вашей программы, минута,час,день месяца, месяц - последняя цифра в номере зачетки, показывать этот список, удалять из списка  (скриншоты в отчет)  
`sudo crontab -e`  
В конце добавить: `9 9 9 9 * root ./home/taiiiga/c/khisamov`  
3. прописать в crontab, задание на запуск задание для вашей программы, минута,час,день месяца, месяц - последняя цифра в номере зачетки (скриншоты в отчет)  
Уже сделали.  
4. запустите свою программу  
`gcc khisamov.c -o khisamov && sudo ./khisamov`  
5. пошлите сигнал на прекращение процесса вашей программы по ID и по имени  (скриншоты в отчет)  
`ps aux | grep khisamov`  
`kill "ввести айди сюда"`  
`ps aux | grep khisamov`  
6. запустите процесс вашей программы с конкретным приоритетом (скриншоты в отчет)  
`sudo nice -n 9 ./khisamov`  
7. измените приоритет процесса вашей программы (скриншоты в отчет)  
`ps aux | grep khisamov`  
`sudo renice +4 "введи сюда айди"`    
8. выведите информацию о работающих процессах (ps) (скриншоты в отчет)  
`ps aux`  
9. запустите процесс вашей программы в фоновом режиме, выведите из фонового режима (скриншоты в отчет)  
`./khisamov &`  
`fg`   
10. запустите процесс вашей программы в интерактивном режиме, переведите в спящий режим, переведите в фоновый режим, выведите из фонового режима (скриншоты в отчет)  
`./khisamov`  
`bg`  
`fg`  
`Ctrl + C`  
11. передайте выходной поток другой программе (поток ps) (скриншоты в отчет)  
`ps -ax | ./khisamov`  
12. запишите выходной поток процесса (поток ps) в файл (скриншоты в отчет)  
`ps -ax > process`  
`cat process`  
13. вывести информацию о работающих процессах, с различным количеством столбцов и процессов (ps) (скриншоты в отчет)  
`ps au`    
`ps -x`    
14. вывести динамическую информацию о процессах, сортировать эту информацию по столбцам, убирать и добавлять столбцы, менять приоритет процесса, уничтожать процесс. (top) (скриншоты в отчет)  
`top`  
`top -o USER`    
## Что надо изучить
1. процессы и потоки  
2. многозадачность 
3. состояние
4. планирование
5. борьба за ресурсы
6. блокировки
